Microchip-MPLAB-Harmony/csp/apps/flexcom/flexcom_spi_eeprom/firmware/src/packs/ATSAMA5D27_DFP/component/matrix.h
#define MATRIX_MEIMR_MERR_Pos                 _U_(0)                                               /**< (MATRIX_MEIMR Position) Master xx Access Error */
#define MATRIX_MEIMR_MERR_Msk                 (_U_(0xFFF) << MATRIX_MEIMR_MERR_Pos)                /**< (MATRIX_MEIMR Mask) MERR */
#define MATRIX_MEIMR_MERR(value)              (MATRIX_MEIMR_MERR_Msk & ((value) << MATRIX_MEIMR_MERR_Pos)) 

/* -------- MATRIX_MESR : (MATRIX Offset: 0x15C) ( R/ 32) Master Error Status Register -------- */
#define MATRIX_MESR_MERR0_Pos                 _U_(0)                                               /**< (MATRIX_MESR) Master 0 Access Error Position */
#define MATRIX_MESR_MERR0_Msk                 (_U_(0x1) << MATRIX_MESR_MERR0_Pos)                  /**< (MATRIX_MESR) Master 0 Access Error Mask */
#define MATRIX_MESR_MERR0(value)              (MATRIX_MESR_MERR0_Msk & ((value) << MATRIX_MESR_MERR0_Pos))
#define MATRIX_MESR_MERR1_Pos                 _U_(1)                                               /**< (MATRIX_MESR) Master 1 Access Error Position */
#define MATRIX_MESR_MERR1_Msk                 (_U_(0x1) << MATRIX_MESR_MERR1_Pos)                  /**< (MATRIX_MESR) Master 1 Access Error Mask */
#define MATRIX_MESR_MERR1(value)              (MATRIX_MESR_MERR1_Msk & ((value) << MATRIX_MESR_MERR1_Pos))
#define MATRIX_MESR_MERR2_Pos                 _U_(2)                                               /**< (MATRIX_MESR) Master 2 Access Error Position */
#define MATRIX_MESR_MERR2_Msk                 (_U_(0x1) << MATRIX_MESR_MERR2_Pos)                  /**< (MATRIX_MESR) Master 2 Access Error Mask */
#define MATRIX_MESR_MERR2(value)              (MATRIX_MESR_MERR2_Msk & ((value) << MATRIX_MESR_MERR2_Pos))
#define MATRIX_MESR_MERR3_Pos                 _U_(3)                                               /**< (MATRIX_MESR) Master 3 Access Error Position */
#define MATRIX_MESR_MERR3_Msk                 (_U_(0x1) << MATRIX_MESR_MERR3_Pos)                  /**< (MATRIX_MESR) Master 3 Access Error Mask */
#define MATRIX_MESR_MERR3(value)              (MATRIX_MESR_MERR3_Msk & ((value) << MATRIX_MESR_MERR3_Pos))
#define MATRIX_MESR_MERR4_Pos                 _U_(4)                                               /**< (MATRIX_MESR) Master 4 Access Error Position */
#define MATRIX_MESR_MERR4_Msk                 (_U_(0x1) << MATRIX_MESR_MERR4_Pos)                  /**< (MATRIX_MESR) Master 4 Access Error Mask */
#define MATRIX_MESR_MERR4(value)              (MATRIX_MESR_MERR4_Msk & ((value) << MATRIX_MESR_MERR4_Pos))
#define MATRIX_MESR_MERR5_Pos                 _U_(5)                                               /**< (MATRIX_MESR) Master 5 Access Error Position */
#define MATRIX_MESR_MERR5_Msk                 (_U_(0x1) << MATRIX_MESR_MERR5_Pos)                  /**< (MATRIX_MESR) Master 5 Access Error Mask */
#define MATRIX_MESR_MERR5(value)              (MATRIX_MESR_MERR5_Msk & ((value) << MATRIX_MESR_MERR5_Pos))
#define MATRIX_MESR_MERR6_Pos                 _U_(6)                                               /**< (MATRIX_MESR) Master 6 Access Error Position */
#define MATRIX_MESR_MERR6_Msk                 (_U_(0x1) << MATRIX_MESR_MERR6_Pos)                  /**< (MATRIX_MESR) Master 6 Access Error Mask */
#define MATRIX_MESR_MERR6(value)              (MATRIX_MESR_MERR6_Msk & ((value) << MATRIX_MESR_MERR6_Pos))
#define MATRIX_MESR_MERR7_Pos                 _U_(7)                                               /**< (MATRIX_MESR) Master 7 Access Error Position */
#define MATRIX_MESR_MERR7_Msk                 (_U_(0x1) << MATRIX_MESR_MERR7_Pos)                  /**< (MATRIX_MESR) Master 7 Access Error Mask */
#define MATRIX_MESR_MERR7(value)              (MATRIX_MESR_MERR7_Msk & ((value) << MATRIX_MESR_MERR7_Pos))
#define MATRIX_MESR_MERR8_Pos                 _U_(8)                                               /**< (MATRIX_MESR) Master 8 Access Error Position */
#define MATRIX_MESR_MERR8_Msk                 (_U_(0x1) << MATRIX_MESR_MERR8_Pos)                  /**< (MATRIX_MESR) Master 8 Access Error Mask */
#define MATRIX_MESR_MERR8(value)              (MATRIX_MESR_MERR8_Msk & ((value) << MATRIX_MESR_MERR8_Pos))
#define MATRIX_MESR_MERR9_Pos                 _U_(9)                                               /**< (MATRIX_MESR) Master 9 Access Error Position */
#define MATRIX_MESR_MERR9_Msk                 (_U_(0x1) << MATRIX_MESR_MERR9_Pos)                  /**< (MATRIX_MESR) Master 9 Access Error Mask */
#define MATRIX_MESR_MERR9(value)              (MATRIX_MESR_MERR9_Msk & ((value) << MATRIX_MESR_MERR9_Pos))
#define MATRIX_MESR_MERR10_Pos                _U_(10)                                              /**< (MATRIX_MESR) Master 10 Access Error Position */
#define MATRIX_MESR_MERR10_Msk                (_U_(0x1) << MATRIX_MESR_MERR10_Pos)                 /**< (MATRIX_MESR) Master 10 Access Error Mask */
#define MATRIX_MESR_MERR10(value)             (MATRIX_MESR_MERR10_Msk & ((value) << MATRIX_MESR_MERR10_Pos))
#define MATRIX_MESR_MERR11_Pos                _U_(11)                                              /**< (MATRIX_MESR) Master 11 Access Error Position */
#define MATRIX_MESR_MERR11_Msk                (_U_(0x1) << MATRIX_MESR_MERR11_Pos)                 /**< (MATRIX_MESR) Master 11 Access Error Mask */
#define MATRIX_MESR_MERR11(value)             (MATRIX_MESR_MERR11_Msk & ((value) << MATRIX_MESR_MERR11_Pos))
#define MATRIX_MESR_Msk                       _U_(0x00000FFF)                                      /**< (MATRIX_MESR) Register Mask  */

#define MATRIX_MESR_MERR_Pos                  _U_(0)                                               /**< (MATRIX_MESR Position) Master xx Access Error */
#define MATRIX_MESR_MERR_Msk                  (_U_(0xFFF) << MATRIX_MESR_MERR_Pos)                 /**< (MATRIX_MESR Mask) MERR */
#define MATRIX_MESR_MERR(value)               (MATRIX_MESR_MERR_Msk & ((value) << MATRIX_MESR_MERR_Pos)) 

/* -------- MATRIX_MEAR : (MATRIX Offset: 0x160) ( R/ 32) Master 0 Error Address Register -------- */
#define MATRIX_MEAR_ERRADD_Pos                _U_(0)                                               /**< (MATRIX_MEAR) Master Error Address Position */
#define MATRIX_MEAR_ERRADD_Msk                (_U_(0xFFFFFFFF) << MATRIX_MEAR_ERRADD_Pos)          /**< (MATRIX_MEAR) Master Error Address Mask */
#define MATRIX_MEAR_ERRADD(value)             (MATRIX_MEAR_ERRADD_Msk & ((value) << MATRIX_MEAR_ERRADD_Pos))
#define MATRIX_MEAR_Msk                       _U_(0xFFFFFFFF)                                      /**< (MATRIX_MEAR) Register Mask  */


/* -------- MATRIX_WPMR : (MATRIX Offset: 0x1E4) (R/W 32) Write Protection Mode Register -------- */
#define MATRIX_WPMR_WPEN_Pos                  _U_(0)                                               /**< (MATRIX_WPMR) Write Protection Enable Position */
#define MATRIX_WPMR_WPEN_Msk                  (_U_(0x1) << MATRIX_WPMR_WPEN_Pos)                   /**< (MATRIX_WPMR) Write Protection Enable Mask */
#define MATRIX_WPMR_WPEN(value)               (MATRIX_WPMR_WPEN_Msk & ((value) << MATRIX_WPMR_WPEN_Pos))
#define MATRIX_WPMR_WPKEY_Pos                 _U_(8)                                               /**< (MATRIX_WPMR) Write Protection Key (Write-only) Position */
#define MATRIX_WPMR_WPKEY_Msk                 (_U_(0xFFFFFF) << MATRIX_WPMR_WPKEY_Pos)             /**< (MATRIX_WPMR) Write Protection Key (Write-only) Mask */
#define MATRIX_WPMR_WPKEY(value)              (MATRIX_WPMR_WPKEY_Msk & ((value) << MATRIX_WPMR_WPKEY_Pos))
#define   MATRIX_WPMR_WPKEY_PASSWD_Val        _U_(0x4D4154)                                        /**< (MATRIX_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0.  */
#define MATRIX_WPMR_WPKEY_PASSWD              (MATRIX_WPMR_WPKEY_PASSWD_Val << MATRIX_WPMR_WPKEY_Pos) /**< (MATRIX_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0. Position  */
#define MATRIX_WPMR_Msk                       _U_(0xFFFFFF01)                                      /**< (MATRIX_WPMR) Register Mask  */


/* -------- MATRIX_WPSR : (MATRIX Offset: 0x1E8) ( R/ 32) Write Protection Status Register -------- */
#define MATRIX_WPSR_WPVS_Pos                  _U_(0)                                               /**< (MATRIX_WPSR) Write Protection Violation Status Position */
#define MATRIX_WPSR_WPVS_Msk                  (_U_(0x1) << MATRIX_WPSR_WPVS_Pos)                   /**< (MATRIX_WPSR) Write Protection Violation Status Mask */
#define MATRIX_WPSR_WPVS(value)               (MATRIX_WPSR_WPVS_Msk & ((value) << MATRIX_WPSR_WPVS_Pos))
#define MATRIX_WPSR_WPVSRC_Pos                _U_(8)                                               /**< (MATRIX_WPSR) Write Protection Violation Source Position */
#define MATRIX_WPSR_WPVSRC_Msk                (_U_(0xFFFF) << MATRIX_WPSR_WPVSRC_Pos)              /**< (MATRIX_WPSR) Write Protection Violation Source Mask */
#define MATRIX_WPSR_WPVSRC(value)             (MATRIX_WPSR_WPVSRC_Msk & ((value) << MATRIX_WPSR_WPVSRC_Pos))
#define MATRIX_WPSR_Msk                       _U_(0x00FFFF01)                                      /**< (MATRIX_WPSR) Register Mask  */


/* -------- MATRIX_SSR : (MATRIX Offset: 0x200) (R/W 32) Security Slave 0 Register -------- */
#define MATRIX_SSR_LANSECH0_Pos               _U_(0)                                               /**< (MATRIX_SSR) Low Area Non-secured in HSELx Security Region Position */
#define MATRIX_SSR_LANSECH0_Msk               (_U_(0x1) << MATRIX_SSR_LANSECH0_Pos)                /**< (MATRIX_SSR) Low Area Non-secured in HSELx Security Region Mask */
#define MATRIX_SSR_LANSECH0(value)            (MATRIX_SSR_LANSECH0_Msk & ((value) << MATRIX_SSR_LANSECH0_Pos))
#define MATRIX_SSR_LANSECH1_Pos               _U_(1)                                               /**< (MATRIX_SSR) Low Area Non-secured in HSELx Security Region Position */
#define MATRIX_SSR_LANSECH1_Msk               (_U_(0x1) << MATRIX_SSR_LANSECH1_Pos)                /**< (MATRIX_SSR) Low Area Non-secured in HSELx Security Region Mask */
#define MATRIX_SSR_LANSECH1(value)            (MATRIX_SSR_LANSECH1_Msk & ((value) << MATRIX_SSR_LANSECH1_Pos))
#define MATRIX_SSR_LANSECH2_Pos               _U_(2)                                               /**< (MATRIX_SSR) Low Area Non-secured in HSELx Security Region Position */
#define MATRIX_SSR_LANSECH2_Msk               (_U_(0x1) << MATRIX_SSR_LANSECH2_Pos)                /**< (MATRIX_SSR) Low Area Non-secured in HSELx Security Region Mask */
#define MATRIX_SSR_LANSECH2(value)            (MATRIX_SSR_LANSECH2_Msk & ((value) << MATRIX_SSR_LANSECH2_Pos))
#define MATRIX_SSR_LANSECH3_Pos               _U_(3)                                               /**< (MATRIX_SSR) Low Area Non-secured in HSELx Security Region Position */
#define MATRIX_SSR_LANSECH3_Msk               (_U_(0x1) << MATRIX_SSR_LANSECH3_Pos)                /**< (MATRIX_SSR) Low Area Non-secured in HSELx Security Region Mask */
#define MATRIX_SSR_LANSECH3(value)            (MATRIX_SSR_LANSECH3_Msk & ((value) << MATRIX_SSR_LANSECH3_Pos))
#define MATRIX_SSR_LANSECH4_Pos               _U_(4)                                               /**< (MATRIX_SSR) Low Area Non-secured in HSELx Security Region Position */
#define MATRIX_SSR_LANSECH4_Msk               (_U_(0x1) << MATRIX_SSR_LANSECH4_Pos)                /**< (MATRIX_SSR) Low Area Non-secured in HSELx Security Region Mask */
#define MATRIX_SSR_LANSECH4(value)            (MATRIX_SSR_LANSECH4_Msk & ((value) << MATRIX_SSR_LANSECH4_Pos))
#define MATRIX_SSR_LANSECH5_Pos               _U_(5)                                               /**< (MATRIX_SSR) Low Area Non-secured in HSELx Security Region Position */
#define MATRIX_SSR_LANSECH5_Msk               (_U_(0x1) << MATRIX_SSR_LANSECH5_Pos)                /**< (MATRIX_SSR) Low Area Non-secured in HSELx Security Region Mask */
#define MATRIX_SSR_LANSECH5(value)            (MATRIX_SSR_LANSECH5_Msk & ((value) << MATRIX_SSR_LANSECH5_Pos))
#define MATRIX_SSR_LANSECH6_Pos               _U_(6)                                               /**< (MATRIX_SSR) Low Area Non-secured in HSELx Security Region Position */
#define MATRIX_SSR_LANSECH6_Msk               (_U_(0x1) << MATRIX_SSR_LANSECH6_Pos)                /**< (MATRIX_SSR) Low Area Non-secured in HSELx Security Region Mask */
#define MATRIX_SSR_LANSECH6(value)            (MATRIX_SSR_LANSECH6_Msk & ((value) << MATRIX_SSR_LANSECH6_Pos))
#define MATRIX_SSR_LANSECH7_Pos               _U_(7)                                               /**< (MATRIX_SSR) Low Area Non-secured in HSELx Security Region Position */
#define MATRIX_SSR_LANSECH7_Msk               (_U_(0x1) << MATRIX_SSR_LANSECH7_Pos)                /**< (MATRIX_SSR) Low Area Non-secured in HSELx Security Region Mask */
#define MATRIX_SSR_LANSECH7(value)            (MATRIX_SSR_LANSECH7_Msk & ((value) << MATRIX_SSR_LANSECH7_Pos))
#define MATRIX_SSR_RDNSECH0_Pos               _U_(8)                                               /**< (MATRIX_SSR) Read Non-secured for HSELx Security Region Position */
#define MATRIX_SSR_RDNSECH0_Msk               (_U_(0x1) << MATRIX_SSR_RDNSECH0_Pos)                /**< (MATRIX_SSR) Read Non-secured for HSELx Security Region Mask */
#define MATRIX_SSR_RDNSECH0(value)            (MATRIX_SSR_RDNSECH0_Msk & ((value) << MATRIX_SSR_RDNSECH0_Pos))
#define MATRIX_SSR_RDNSECH1_Pos               _U_(9)                                               /**< (MATRIX_SSR) Read Non-secured for HSELx Security Region Position */
#define MATRIX_SSR_RDNSECH1_Msk               (_U_(0x1) << MATRIX_SSR_RDNSECH1_Pos)                /**< (MATRIX_SSR) Read Non-secured for HSELx Security Region Mask */
#define MATRIX_SSR_RDNSECH1(value)            (MATRIX_SSR_RDNSECH1_Msk & ((value) << MATRIX_SSR_RDNSECH1_Pos))
#define MATRIX_SSR_RDNSECH2_Pos               _U_(10)                                              /**< (MATRIX_SSR) Read Non-secured for HSELx Security Region Position */
#define MATRIX_SSR_RDNSECH2_Msk               (_U_(0x1) << MATRIX_SSR_RDNSECH2_Pos)                /**< (MATRIX_SSR) Read Non-secured for HSELx Security Region Mask */
#define MATRIX_SSR_RDNSECH2(value)            (MATRIX_SSR_RDNSECH2_Msk & ((value) << MATRIX_SSR_RDNSECH2_Pos))
#define MATRIX_SSR_RDNSECH3_Pos               _U_(11)                                              /**< (MATRIX_SSR) Read Non-secured for HSELx Security Region Position */
#define MATRIX_SSR_RDNSECH3_Msk               (_U_(0x1) << MATRIX_SSR_RDNSECH3_Pos)                /**< (MATRIX_SSR) Read Non-secured for HSELx Security Region Mask */
#define MATRIX_SSR_RDNSECH3(value)            (MATRIX_SSR_RDNSECH3_Msk & ((value) << MATRIX_SSR_RDNSECH3_Pos))
#define MATRIX_SSR_RDNSECH4_Pos               _U_(12)                                              /**< (MATRIX_SSR) Read Non-secured for HSELx Security Region Position */
#define MATRIX_SSR_RDNSECH4_Msk               (_U_(0x1) << MATRIX_SSR_RDNSECH4_Pos)                /**< (MATRIX_SSR) Read Non-secured for HSELx Security Region Mask */
#define MATRIX_SSR_RDNSECH4(value)            (MATRIX_SSR_RDNSECH4_Msk & ((value) << MATRIX_SSR_RDNSECH4_Pos))
#define MATRIX_SSR_RDNSECH5_Pos               _U_(13)                                              /**< (MATRIX_SSR) Read Non-secured for HSELx Security Region Position */
#define MATRIX_SSR_RDNSECH5_Msk               (_U_(0x1) << MATRIX_SSR_RDNSECH5_Pos)                /**< (MATRIX_SSR) Read Non-secured for HSELx Security Region Mask */
#define MATRIX_SSR_RDNSECH5(value)            (MATRIX_SSR_RDNSECH5_Msk & ((value) << MATRIX_SSR_RDNSECH5_Pos))
#define MATRIX_SSR_RDNSECH6_Pos               _U_(14)                                              /**< (MATRIX_SSR) Read Non-secured for HSELx Security Region Position */
#define MATRIX_SSR_RDNSECH6_Msk               (_U_(0x1) << MATRIX_SSR_RDNSECH6_Pos)                /**< (MATRIX_SSR) Read Non-secured for HSELx Security Region Mask */
#define MATRIX_SSR_RDNSECH6(value)            (MATRIX_SSR_RDNSECH6_Msk & ((value) << MATRIX_SSR_RDNSECH6_Pos))
#define MATRIX_SSR_RDNSECH7_Pos               _U_(15)                                              /**< (MATRIX_SSR) Read Non-secured for HSELx Security Region Position */
#define MATRIX_SSR_RDNSECH7_Msk               (_U_(0x1) << MATRIX_SSR_RDNSECH7_Pos)                /**< (MATRIX_SSR) Read Non-secured for HSELx Security Region Mask */
#define MATRIX_SSR_RDNSECH7(value)            (MATRIX_SSR_RDNSECH7_Msk & ((value) << MATRIX_SSR_RDNSECH7_Pos))
#define MATRIX_SSR_WRNSECH0_Pos               _U_(16)                                              /**< (MATRIX_SSR) Write Non-secured for HSELx Security Region Position */
#define MATRIX_SSR_WRNSECH0_Msk               (_U_(0x1) << MATRIX_SSR_WRNSECH0_Pos)                /**< (MATRIX_SSR) Write Non-secured for HSELx Security Region Mask */
#define MATRIX_SSR_WRNSECH0(value)            (MATRIX_SSR_WRNSECH0_Msk & ((value) << MATRIX_SSR_WRNSECH0_Pos))
#define MATRIX_SSR_WRNSECH1_Pos               _U_(17)                                              /**< (MATRIX_SSR) Write Non-secured for HSELx Security Region Position */
#define MATRIX_SSR_WRNSECH1_Msk               (_U_(0x1) << MATRIX_SSR_WRNSECH1_Pos)                /**< (MATRIX_SSR) Write Non-secured for HSELx Security Region Mask */
#define MATRIX_SSR_WRNSECH1(value)            (MATRIX_SSR_WRNSECH1_Msk & ((value) << MATRIX_SSR_WRNSECH1_Pos))
#define MATRIX_SSR_WRNSECH2_Pos               _U_(18)                                              /**< (MATRIX_SSR) Write Non-secured for HSELx Security Region Position */
#define MATRIX_SSR_WRNSECH2_Msk               (_U_(0x1) << MATRIX_SSR_WRNSECH2_Pos)                /**< (MATRIX_SSR) Write Non-secured for HSELx Security Region Mask */
#define MATRIX_SSR_WRNSECH2(value)            (MATRIX_SSR_WRNSECH2_Msk & ((value) << MATRIX_SSR_WRNSECH2_Pos))
#define MATRIX_SSR_WRNSECH3_Pos               _U_(19)                                              /**< (MATRIX_SSR) Write Non-secured for HSELx Security Region Position */
#define MATRIX_SSR_WRNSECH3_Msk               (_U_(0x1) << MATRIX_SSR_WRNSECH3_Pos)                /**< (MATRIX_SSR) Write Non-secured for HSELx Security Region Mask */
#define MATRIX_SSR_WRNSECH3(value)            (MATRIX_SSR_WRNSECH3_Msk & ((value) << MATRIX_SSR_WRNSECH3_Pos))
#define MATRIX_SSR_WRNSECH4_Pos               _U_(20)                                              /**< (MATRIX_SSR) Write Non-secured for HSELx Security Region Position */
#define MATRIX_SSR_WRNSECH4_Msk               (_U_(0x1) << MATRIX_SSR_WRNSECH4_Pos)                /**< (MATRIX_SSR) Write Non-secured for HSELx Security Region Mask */
#define MATRIX_SSR_WRNSECH4(value)            (MATRIX_SSR_WRNSECH4_Msk & ((value) << MATRIX_SSR_WRNSECH4_Pos))
#define MATRIX_SSR_WRNSECH5_Pos               _U_(21)                                              /**< (MATRIX_SSR) Write Non-secured for HSELx Security Region Position */
#define MATRIX_SSR_WRNSECH5_Msk               (_U_(0x1) << MATRIX_SSR_WRNSECH5_Pos)                /**< (MATRIX_SSR) Write Non-secured for HSELx Security Region Mask */
#define MATRIX_SSR_WRNSECH5(value)            (MATRIX_SSR_WRNSECH5_Msk & ((value) << MATRIX_SSR_WRNSECH5_Pos))
#define MATRIX_SSR_WRNSECH6_Pos               _U_(22)                                              /**< (MATRIX_SSR) Write Non-secured for HSELx Security Region Position */
#define MATRIX_SSR_WRNSECH6_Msk               (_U_(0x1) << MATRIX_SSR_WRNSECH6_Pos)                /**< (MATRIX_SSR) Write Non-secured for HSELx Security Region Mask */
#define MATRIX_SSR_WRNSECH6(value)            (MATRIX_SSR_WRNSECH6_Msk & ((value) << MATRIX_SSR_WRNSECH6_Pos))
#define MATRIX_SSR_WRNSECH7_Pos               _U_(23)                                              /**< (MATRIX_SSR) Write Non-secured for HSELx Security Region Position */
#define MATRIX_SSR_WRNSECH7_Msk               (_U_(0x1) << MATRIX_SSR_WRNSECH7_Pos)                /**< (MATRIX_SSR) Write Non-secured for HSELx Security Region Mask */
#define MATRIX_SSR_WRNSECH7(value)            (MATRIX_SSR_WRNSECH7_Msk & ((value) << MATRIX_SSR_WRNSECH7_Pos))
#define MATRIX_SSR_Msk                        _U_(0x00FFFFFF)                                      /**< (MATRIX_SSR) Register Mask  */

#define MATRIX_SSR_LANSECH_Pos                _U_(0)                                               /**< (MATRIX_SSR Position) Low Area Non-secured in HSELx Security Region */
#define MATRIX_SSR_LANSECH_Msk                (_U_(0xFF) << MATRIX_SSR_LANSECH_Pos)                /**< (MATRIX_SSR Mask) LANSECH */
#define MATRIX_SSR_LANSECH(value)             (MATRIX_SSR_LANSECH_Msk & ((value) << MATRIX_SSR_LANSECH_Pos)) 
#define MATRIX_SSR_RDNSECH_Pos                _U_(8)                                               /**< (MATRIX_SSR Position) Read Non-secured for HSELx Security Region */
#define MATRIX_SSR_RDNSECH_Msk                (_U_(0xFF) << MATRIX_SSR_RDNSECH_Pos)                /**< (MATRIX_SSR Mask) RDNSECH */
#define MATRIX_SSR_RDNSECH(value)             (MATRIX_SSR_RDNSECH_Msk & ((value) << MATRIX_SSR_RDNSECH_Pos)) 
#define MATRIX_SSR_WRNSECH_Pos                _U_(16)                                              /**< (MATRIX_SSR Position) Write Non-secured for HSELx Security Region */
#define MATRIX_SSR_WRNSECH_Msk                (_U_(0xFF) << MATRIX_SSR_WRNSECH_Pos)                /**< (MATRIX_SSR Mask) WRNSECH */
#define MATRIX_SSR_WRNSECH(value)             (MATRIX_SSR_WRNSECH_Msk & ((value) << MATRIX_SSR_WRNSECH_Pos)) 

