Microchip-MPLAB-Harmony/csp/apps/flexcom/flexcom_spi_eeprom/firmware/src/packs/ATSAMA5D27_DFP/component/matrix.h
/* -------- MATRIX_SASSR : (MATRIX Offset: 0x240) (R/W 32) Security Areas Split Slave 0 Register -------- */
#define MATRIX_SASSR_SASPLIT0_Pos             _U_(0)                                               /**< (MATRIX_SASSR) Security Areas Split for HSELx Security Region Position */
#define MATRIX_SASSR_SASPLIT0_Msk             (_U_(0xF) << MATRIX_SASSR_SASPLIT0_Pos)              /**< (MATRIX_SASSR) Security Areas Split for HSELx Security Region Mask */
#define MATRIX_SASSR_SASPLIT0(value)          (MATRIX_SASSR_SASPLIT0_Msk & ((value) << MATRIX_SASSR_SASPLIT0_Pos))
#define MATRIX_SASSR_SASPLIT1_Pos             _U_(4)                                               /**< (MATRIX_SASSR) Security Areas Split for HSELx Security Region Position */
#define MATRIX_SASSR_SASPLIT1_Msk             (_U_(0xF) << MATRIX_SASSR_SASPLIT1_Pos)              /**< (MATRIX_SASSR) Security Areas Split for HSELx Security Region Mask */
#define MATRIX_SASSR_SASPLIT1(value)          (MATRIX_SASSR_SASPLIT1_Msk & ((value) << MATRIX_SASSR_SASPLIT1_Pos))
#define MATRIX_SASSR_SASPLIT2_Pos             _U_(8)                                               /**< (MATRIX_SASSR) Security Areas Split for HSELx Security Region Position */
#define MATRIX_SASSR_SASPLIT2_Msk             (_U_(0xF) << MATRIX_SASSR_SASPLIT2_Pos)              /**< (MATRIX_SASSR) Security Areas Split for HSELx Security Region Mask */
#define MATRIX_SASSR_SASPLIT2(value)          (MATRIX_SASSR_SASPLIT2_Msk & ((value) << MATRIX_SASSR_SASPLIT2_Pos))
#define MATRIX_SASSR_SASPLIT3_Pos             _U_(12)                                              /**< (MATRIX_SASSR) Security Areas Split for HSELx Security Region Position */
#define MATRIX_SASSR_SASPLIT3_Msk             (_U_(0xF) << MATRIX_SASSR_SASPLIT3_Pos)              /**< (MATRIX_SASSR) Security Areas Split for HSELx Security Region Mask */
#define MATRIX_SASSR_SASPLIT3(value)          (MATRIX_SASSR_SASPLIT3_Msk & ((value) << MATRIX_SASSR_SASPLIT3_Pos))
#define MATRIX_SASSR_SASPLIT4_Pos             _U_(16)                                              /**< (MATRIX_SASSR) Security Areas Split for HSELx Security Region Position */
#define MATRIX_SASSR_SASPLIT4_Msk             (_U_(0xF) << MATRIX_SASSR_SASPLIT4_Pos)              /**< (MATRIX_SASSR) Security Areas Split for HSELx Security Region Mask */
#define MATRIX_SASSR_SASPLIT4(value)          (MATRIX_SASSR_SASPLIT4_Msk & ((value) << MATRIX_SASSR_SASPLIT4_Pos))
#define MATRIX_SASSR_SASPLIT5_Pos             _U_(20)                                              /**< (MATRIX_SASSR) Security Areas Split for HSELx Security Region Position */
#define MATRIX_SASSR_SASPLIT5_Msk             (_U_(0xF) << MATRIX_SASSR_SASPLIT5_Pos)              /**< (MATRIX_SASSR) Security Areas Split for HSELx Security Region Mask */
#define MATRIX_SASSR_SASPLIT5(value)          (MATRIX_SASSR_SASPLIT5_Msk & ((value) << MATRIX_SASSR_SASPLIT5_Pos))
#define MATRIX_SASSR_SASPLIT6_Pos             _U_(24)                                              /**< (MATRIX_SASSR) Security Areas Split for HSELx Security Region Position */
#define MATRIX_SASSR_SASPLIT6_Msk             (_U_(0xF) << MATRIX_SASSR_SASPLIT6_Pos)              /**< (MATRIX_SASSR) Security Areas Split for HSELx Security Region Mask */
#define MATRIX_SASSR_SASPLIT6(value)          (MATRIX_SASSR_SASPLIT6_Msk & ((value) << MATRIX_SASSR_SASPLIT6_Pos))
#define MATRIX_SASSR_SASPLIT7_Pos             _U_(28)                                              /**< (MATRIX_SASSR) Security Areas Split for HSELx Security Region Position */
#define MATRIX_SASSR_SASPLIT7_Msk             (_U_(0xF) << MATRIX_SASSR_SASPLIT7_Pos)              /**< (MATRIX_SASSR) Security Areas Split for HSELx Security Region Mask */
#define MATRIX_SASSR_SASPLIT7(value)          (MATRIX_SASSR_SASPLIT7_Msk & ((value) << MATRIX_SASSR_SASPLIT7_Pos))
#define MATRIX_SASSR_Msk                      _U_(0xFFFFFFFF)                                      /**< (MATRIX_SASSR) Register Mask  */


/* -------- MATRIX_SRTSR : (MATRIX Offset: 0x284) (R/W 32) Security Region Top Slave 1 Register -------- */
#define MATRIX_SRTSR_SRTOP0_Pos               _U_(0)                                               /**< (MATRIX_SRTSR) HSELx Security Region Top Position */
#define MATRIX_SRTSR_SRTOP0_Msk               (_U_(0xF) << MATRIX_SRTSR_SRTOP0_Pos)                /**< (MATRIX_SRTSR) HSELx Security Region Top Mask */
#define MATRIX_SRTSR_SRTOP0(value)            (MATRIX_SRTSR_SRTOP0_Msk & ((value) << MATRIX_SRTSR_SRTOP0_Pos))
#define MATRIX_SRTSR_SRTOP1_Pos               _U_(4)                                               /**< (MATRIX_SRTSR) HSELx Security Region Top Position */
#define MATRIX_SRTSR_SRTOP1_Msk               (_U_(0xF) << MATRIX_SRTSR_SRTOP1_Pos)                /**< (MATRIX_SRTSR) HSELx Security Region Top Mask */
#define MATRIX_SRTSR_SRTOP1(value)            (MATRIX_SRTSR_SRTOP1_Msk & ((value) << MATRIX_SRTSR_SRTOP1_Pos))
#define MATRIX_SRTSR_SRTOP2_Pos               _U_(8)                                               /**< (MATRIX_SRTSR) HSELx Security Region Top Position */
#define MATRIX_SRTSR_SRTOP2_Msk               (_U_(0xF) << MATRIX_SRTSR_SRTOP2_Pos)                /**< (MATRIX_SRTSR) HSELx Security Region Top Mask */
#define MATRIX_SRTSR_SRTOP2(value)            (MATRIX_SRTSR_SRTOP2_Msk & ((value) << MATRIX_SRTSR_SRTOP2_Pos))
#define MATRIX_SRTSR_SRTOP3_Pos               _U_(12)                                              /**< (MATRIX_SRTSR) HSELx Security Region Top Position */
#define MATRIX_SRTSR_SRTOP3_Msk               (_U_(0xF) << MATRIX_SRTSR_SRTOP3_Pos)                /**< (MATRIX_SRTSR) HSELx Security Region Top Mask */
#define MATRIX_SRTSR_SRTOP3(value)            (MATRIX_SRTSR_SRTOP3_Msk & ((value) << MATRIX_SRTSR_SRTOP3_Pos))
#define MATRIX_SRTSR_SRTOP4_Pos               _U_(16)                                              /**< (MATRIX_SRTSR) HSELx Security Region Top Position */
#define MATRIX_SRTSR_SRTOP4_Msk               (_U_(0xF) << MATRIX_SRTSR_SRTOP4_Pos)                /**< (MATRIX_SRTSR) HSELx Security Region Top Mask */
#define MATRIX_SRTSR_SRTOP4(value)            (MATRIX_SRTSR_SRTOP4_Msk & ((value) << MATRIX_SRTSR_SRTOP4_Pos))
#define MATRIX_SRTSR_SRTOP5_Pos               _U_(20)                                              /**< (MATRIX_SRTSR) HSELx Security Region Top Position */
#define MATRIX_SRTSR_SRTOP5_Msk               (_U_(0xF) << MATRIX_SRTSR_SRTOP5_Pos)                /**< (MATRIX_SRTSR) HSELx Security Region Top Mask */
#define MATRIX_SRTSR_SRTOP5(value)            (MATRIX_SRTSR_SRTOP5_Msk & ((value) << MATRIX_SRTSR_SRTOP5_Pos))
#define MATRIX_SRTSR_SRTOP6_Pos               _U_(24)                                              /**< (MATRIX_SRTSR) HSELx Security Region Top Position */
#define MATRIX_SRTSR_SRTOP6_Msk               (_U_(0xF) << MATRIX_SRTSR_SRTOP6_Pos)                /**< (MATRIX_SRTSR) HSELx Security Region Top Mask */
#define MATRIX_SRTSR_SRTOP6(value)            (MATRIX_SRTSR_SRTOP6_Msk & ((value) << MATRIX_SRTSR_SRTOP6_Pos))
#define MATRIX_SRTSR_SRTOP7_Pos               _U_(28)                                              /**< (MATRIX_SRTSR) HSELx Security Region Top Position */
#define MATRIX_SRTSR_SRTOP7_Msk               (_U_(0xF) << MATRIX_SRTSR_SRTOP7_Pos)                /**< (MATRIX_SRTSR) HSELx Security Region Top Mask */
#define MATRIX_SRTSR_SRTOP7(value)            (MATRIX_SRTSR_SRTOP7_Msk & ((value) << MATRIX_SRTSR_SRTOP7_Pos))
#define MATRIX_SRTSR_Msk                      _U_(0xFFFFFFFF)                                      /**< (MATRIX_SRTSR) Register Mask  */


