Microchip-MPLAB-Harmony/csp/apps/flexcom/flexcom_spi_eeprom/firmware/src/packs/ATSAMA5D27_DFP/component/matrix.h
/* -------- MATRIX_SPSELR : (MATRIX Offset: 0x2C0) (R/W 32) Security Peripheral Select 1 Register -------- */
#define MATRIX_SPSELR_NSECP0_Pos              _U_(0)                                               /**< (MATRIX_SPSELR) Non-secured Peripheral Position */
#define MATRIX_SPSELR_NSECP0_Msk              (_U_(0x1) << MATRIX_SPSELR_NSECP0_Pos)               /**< (MATRIX_SPSELR) Non-secured Peripheral Mask */
#define MATRIX_SPSELR_NSECP0(value)           (MATRIX_SPSELR_NSECP0_Msk & ((value) << MATRIX_SPSELR_NSECP0_Pos))
#define MATRIX_SPSELR_NSECP1_Pos              _U_(1)                                               /**< (MATRIX_SPSELR) Non-secured Peripheral Position */
#define MATRIX_SPSELR_NSECP1_Msk              (_U_(0x1) << MATRIX_SPSELR_NSECP1_Pos)               /**< (MATRIX_SPSELR) Non-secured Peripheral Mask */
#define MATRIX_SPSELR_NSECP1(value)           (MATRIX_SPSELR_NSECP1_Msk & ((value) << MATRIX_SPSELR_NSECP1_Pos))
#define MATRIX_SPSELR_NSECP2_Pos              _U_(2)                                               /**< (MATRIX_SPSELR) Non-secured Peripheral Position */
#define MATRIX_SPSELR_NSECP2_Msk              (_U_(0x1) << MATRIX_SPSELR_NSECP2_Pos)               /**< (MATRIX_SPSELR) Non-secured Peripheral Mask */
#define MATRIX_SPSELR_NSECP2(value)           (MATRIX_SPSELR_NSECP2_Msk & ((value) << MATRIX_SPSELR_NSECP2_Pos))
#define MATRIX_SPSELR_NSECP3_Pos              _U_(3)                                               /**< (MATRIX_SPSELR) Non-secured Peripheral Position */
#define MATRIX_SPSELR_NSECP3_Msk              (_U_(0x1) << MATRIX_SPSELR_NSECP3_Pos)               /**< (MATRIX_SPSELR) Non-secured Peripheral Mask */
#define MATRIX_SPSELR_NSECP3(value)           (MATRIX_SPSELR_NSECP3_Msk & ((value) << MATRIX_SPSELR_NSECP3_Pos))
#define MATRIX_SPSELR_NSECP4_Pos              _U_(4)                                               /**< (MATRIX_SPSELR) Non-secured Peripheral Position */
#define MATRIX_SPSELR_NSECP4_Msk              (_U_(0x1) << MATRIX_SPSELR_NSECP4_Pos)               /**< (MATRIX_SPSELR) Non-secured Peripheral Mask */
#define MATRIX_SPSELR_NSECP4(value)           (MATRIX_SPSELR_NSECP4_Msk & ((value) << MATRIX_SPSELR_NSECP4_Pos))
#define MATRIX_SPSELR_NSECP5_Pos              _U_(5)                                               /**< (MATRIX_SPSELR) Non-secured Peripheral Position */
#define MATRIX_SPSELR_NSECP5_Msk              (_U_(0x1) << MATRIX_SPSELR_NSECP5_Pos)               /**< (MATRIX_SPSELR) Non-secured Peripheral Mask */
#define MATRIX_SPSELR_NSECP5(value)           (MATRIX_SPSELR_NSECP5_Msk & ((value) << MATRIX_SPSELR_NSECP5_Pos))
#define MATRIX_SPSELR_NSECP6_Pos              _U_(6)                                               /**< (MATRIX_SPSELR) Non-secured Peripheral Position */
#define MATRIX_SPSELR_NSECP6_Msk              (_U_(0x1) << MATRIX_SPSELR_NSECP6_Pos)               /**< (MATRIX_SPSELR) Non-secured Peripheral Mask */
#define MATRIX_SPSELR_NSECP6(value)           (MATRIX_SPSELR_NSECP6_Msk & ((value) << MATRIX_SPSELR_NSECP6_Pos))
#define MATRIX_SPSELR_NSECP7_Pos              _U_(7)                                               /**< (MATRIX_SPSELR) Non-secured Peripheral Position */
#define MATRIX_SPSELR_NSECP7_Msk              (_U_(0x1) << MATRIX_SPSELR_NSECP7_Pos)               /**< (MATRIX_SPSELR) Non-secured Peripheral Mask */
#define MATRIX_SPSELR_NSECP7(value)           (MATRIX_SPSELR_NSECP7_Msk & ((value) << MATRIX_SPSELR_NSECP7_Pos))
#define MATRIX_SPSELR_NSECP8_Pos              _U_(8)                                               /**< (MATRIX_SPSELR) Non-secured Peripheral Position */
#define MATRIX_SPSELR_NSECP8_Msk              (_U_(0x1) << MATRIX_SPSELR_NSECP8_Pos)               /**< (MATRIX_SPSELR) Non-secured Peripheral Mask */
#define MATRIX_SPSELR_NSECP8(value)           (MATRIX_SPSELR_NSECP8_Msk & ((value) << MATRIX_SPSELR_NSECP8_Pos))
#define MATRIX_SPSELR_NSECP9_Pos              _U_(9)                                               /**< (MATRIX_SPSELR) Non-secured Peripheral Position */
#define MATRIX_SPSELR_NSECP9_Msk              (_U_(0x1) << MATRIX_SPSELR_NSECP9_Pos)               /**< (MATRIX_SPSELR) Non-secured Peripheral Mask */
#define MATRIX_SPSELR_NSECP9(value)           (MATRIX_SPSELR_NSECP9_Msk & ((value) << MATRIX_SPSELR_NSECP9_Pos))
#define MATRIX_SPSELR_NSECP10_Pos             _U_(10)                                              /**< (MATRIX_SPSELR) Non-secured Peripheral Position */
#define MATRIX_SPSELR_NSECP10_Msk             (_U_(0x1) << MATRIX_SPSELR_NSECP10_Pos)              /**< (MATRIX_SPSELR) Non-secured Peripheral Mask */
#define MATRIX_SPSELR_NSECP10(value)          (MATRIX_SPSELR_NSECP10_Msk & ((value) << MATRIX_SPSELR_NSECP10_Pos))
#define MATRIX_SPSELR_NSECP11_Pos             _U_(11)                                              /**< (MATRIX_SPSELR) Non-secured Peripheral Position */
#define MATRIX_SPSELR_NSECP11_Msk             (_U_(0x1) << MATRIX_SPSELR_NSECP11_Pos)              /**< (MATRIX_SPSELR) Non-secured Peripheral Mask */
#define MATRIX_SPSELR_NSECP11(value)          (MATRIX_SPSELR_NSECP11_Msk & ((value) << MATRIX_SPSELR_NSECP11_Pos))
#define MATRIX_SPSELR_NSECP12_Pos             _U_(12)                                              /**< (MATRIX_SPSELR) Non-secured Peripheral Position */
#define MATRIX_SPSELR_NSECP12_Msk             (_U_(0x1) << MATRIX_SPSELR_NSECP12_Pos)              /**< (MATRIX_SPSELR) Non-secured Peripheral Mask */
#define MATRIX_SPSELR_NSECP12(value)          (MATRIX_SPSELR_NSECP12_Msk & ((value) << MATRIX_SPSELR_NSECP12_Pos))
#define MATRIX_SPSELR_NSECP13_Pos             _U_(13)                                              /**< (MATRIX_SPSELR) Non-secured Peripheral Position */
#define MATRIX_SPSELR_NSECP13_Msk             (_U_(0x1) << MATRIX_SPSELR_NSECP13_Pos)              /**< (MATRIX_SPSELR) Non-secured Peripheral Mask */
#define MATRIX_SPSELR_NSECP13(value)          (MATRIX_SPSELR_NSECP13_Msk & ((value) << MATRIX_SPSELR_NSECP13_Pos))
#define MATRIX_SPSELR_NSECP14_Pos             _U_(14)                                              /**< (MATRIX_SPSELR) Non-secured Peripheral Position */
#define MATRIX_SPSELR_NSECP14_Msk             (_U_(0x1) << MATRIX_SPSELR_NSECP14_Pos)              /**< (MATRIX_SPSELR) Non-secured Peripheral Mask */
#define MATRIX_SPSELR_NSECP14(value)          (MATRIX_SPSELR_NSECP14_Msk & ((value) << MATRIX_SPSELR_NSECP14_Pos))
#define MATRIX_SPSELR_NSECP15_Pos             _U_(15)                                              /**< (MATRIX_SPSELR) Non-secured Peripheral Position */
#define MATRIX_SPSELR_NSECP15_Msk             (_U_(0x1) << MATRIX_SPSELR_NSECP15_Pos)              /**< (MATRIX_SPSELR) Non-secured Peripheral Mask */
#define MATRIX_SPSELR_NSECP15(value)          (MATRIX_SPSELR_NSECP15_Msk & ((value) << MATRIX_SPSELR_NSECP15_Pos))
#define MATRIX_SPSELR_NSECP16_Pos             _U_(16)                                              /**< (MATRIX_SPSELR) Non-secured Peripheral Position */
#define MATRIX_SPSELR_NSECP16_Msk             (_U_(0x1) << MATRIX_SPSELR_NSECP16_Pos)              /**< (MATRIX_SPSELR) Non-secured Peripheral Mask */
#define MATRIX_SPSELR_NSECP16(value)          (MATRIX_SPSELR_NSECP16_Msk & ((value) << MATRIX_SPSELR_NSECP16_Pos))
#define MATRIX_SPSELR_NSECP17_Pos             _U_(17)                                              /**< (MATRIX_SPSELR) Non-secured Peripheral Position */
#define MATRIX_SPSELR_NSECP17_Msk             (_U_(0x1) << MATRIX_SPSELR_NSECP17_Pos)              /**< (MATRIX_SPSELR) Non-secured Peripheral Mask */
#define MATRIX_SPSELR_NSECP17(value)          (MATRIX_SPSELR_NSECP17_Msk & ((value) << MATRIX_SPSELR_NSECP17_Pos))
#define MATRIX_SPSELR_NSECP18_Pos             _U_(18)                                              /**< (MATRIX_SPSELR) Non-secured Peripheral Position */
#define MATRIX_SPSELR_NSECP18_Msk             (_U_(0x1) << MATRIX_SPSELR_NSECP18_Pos)              /**< (MATRIX_SPSELR) Non-secured Peripheral Mask */
#define MATRIX_SPSELR_NSECP18(value)          (MATRIX_SPSELR_NSECP18_Msk & ((value) << MATRIX_SPSELR_NSECP18_Pos))
#define MATRIX_SPSELR_NSECP19_Pos             _U_(19)                                              /**< (MATRIX_SPSELR) Non-secured Peripheral Position */
#define MATRIX_SPSELR_NSECP19_Msk             (_U_(0x1) << MATRIX_SPSELR_NSECP19_Pos)              /**< (MATRIX_SPSELR) Non-secured Peripheral Mask */
#define MATRIX_SPSELR_NSECP19(value)          (MATRIX_SPSELR_NSECP19_Msk & ((value) << MATRIX_SPSELR_NSECP19_Pos))
#define MATRIX_SPSELR_NSECP20_Pos             _U_(20)                                              /**< (MATRIX_SPSELR) Non-secured Peripheral Position */
#define MATRIX_SPSELR_NSECP20_Msk             (_U_(0x1) << MATRIX_SPSELR_NSECP20_Pos)              /**< (MATRIX_SPSELR) Non-secured Peripheral Mask */
#define MATRIX_SPSELR_NSECP20(value)          (MATRIX_SPSELR_NSECP20_Msk & ((value) << MATRIX_SPSELR_NSECP20_Pos))
#define MATRIX_SPSELR_NSECP21_Pos             _U_(21)                                              /**< (MATRIX_SPSELR) Non-secured Peripheral Position */
#define MATRIX_SPSELR_NSECP21_Msk             (_U_(0x1) << MATRIX_SPSELR_NSECP21_Pos)              /**< (MATRIX_SPSELR) Non-secured Peripheral Mask */
#define MATRIX_SPSELR_NSECP21(value)          (MATRIX_SPSELR_NSECP21_Msk & ((value) << MATRIX_SPSELR_NSECP21_Pos))
#define MATRIX_SPSELR_NSECP22_Pos             _U_(22)                                              /**< (MATRIX_SPSELR) Non-secured Peripheral Position */
#define MATRIX_SPSELR_NSECP22_Msk             (_U_(0x1) << MATRIX_SPSELR_NSECP22_Pos)              /**< (MATRIX_SPSELR) Non-secured Peripheral Mask */
#define MATRIX_SPSELR_NSECP22(value)          (MATRIX_SPSELR_NSECP22_Msk & ((value) << MATRIX_SPSELR_NSECP22_Pos))
#define MATRIX_SPSELR_NSECP23_Pos             _U_(23)                                              /**< (MATRIX_SPSELR) Non-secured Peripheral Position */
#define MATRIX_SPSELR_NSECP23_Msk             (_U_(0x1) << MATRIX_SPSELR_NSECP23_Pos)              /**< (MATRIX_SPSELR) Non-secured Peripheral Mask */
#define MATRIX_SPSELR_NSECP23(value)          (MATRIX_SPSELR_NSECP23_Msk & ((value) << MATRIX_SPSELR_NSECP23_Pos))
#define MATRIX_SPSELR_NSECP24_Pos             _U_(24)                                              /**< (MATRIX_SPSELR) Non-secured Peripheral Position */
#define MATRIX_SPSELR_NSECP24_Msk             (_U_(0x1) << MATRIX_SPSELR_NSECP24_Pos)              /**< (MATRIX_SPSELR) Non-secured Peripheral Mask */
#define MATRIX_SPSELR_NSECP24(value)          (MATRIX_SPSELR_NSECP24_Msk & ((value) << MATRIX_SPSELR_NSECP24_Pos))
#define MATRIX_SPSELR_NSECP25_Pos             _U_(25)                                              /**< (MATRIX_SPSELR) Non-secured Peripheral Position */
#define MATRIX_SPSELR_NSECP25_Msk             (_U_(0x1) << MATRIX_SPSELR_NSECP25_Pos)              /**< (MATRIX_SPSELR) Non-secured Peripheral Mask */
#define MATRIX_SPSELR_NSECP25(value)          (MATRIX_SPSELR_NSECP25_Msk & ((value) << MATRIX_SPSELR_NSECP25_Pos))
#define MATRIX_SPSELR_NSECP26_Pos             _U_(26)                                              /**< (MATRIX_SPSELR) Non-secured Peripheral Position */
#define MATRIX_SPSELR_NSECP26_Msk             (_U_(0x1) << MATRIX_SPSELR_NSECP26_Pos)              /**< (MATRIX_SPSELR) Non-secured Peripheral Mask */
#define MATRIX_SPSELR_NSECP26(value)          (MATRIX_SPSELR_NSECP26_Msk & ((value) << MATRIX_SPSELR_NSECP26_Pos))
#define MATRIX_SPSELR_NSECP27_Pos             _U_(27)                                              /**< (MATRIX_SPSELR) Non-secured Peripheral Position */
#define MATRIX_SPSELR_NSECP27_Msk             (_U_(0x1) << MATRIX_SPSELR_NSECP27_Pos)              /**< (MATRIX_SPSELR) Non-secured Peripheral Mask */
#define MATRIX_SPSELR_NSECP27(value)          (MATRIX_SPSELR_NSECP27_Msk & ((value) << MATRIX_SPSELR_NSECP27_Pos))
#define MATRIX_SPSELR_NSECP28_Pos             _U_(28)                                              /**< (MATRIX_SPSELR) Non-secured Peripheral Position */
#define MATRIX_SPSELR_NSECP28_Msk             (_U_(0x1) << MATRIX_SPSELR_NSECP28_Pos)              /**< (MATRIX_SPSELR) Non-secured Peripheral Mask */
#define MATRIX_SPSELR_NSECP28(value)          (MATRIX_SPSELR_NSECP28_Msk & ((value) << MATRIX_SPSELR_NSECP28_Pos))
#define MATRIX_SPSELR_NSECP29_Pos             _U_(29)                                              /**< (MATRIX_SPSELR) Non-secured Peripheral Position */
#define MATRIX_SPSELR_NSECP29_Msk             (_U_(0x1) << MATRIX_SPSELR_NSECP29_Pos)              /**< (MATRIX_SPSELR) Non-secured Peripheral Mask */
#define MATRIX_SPSELR_NSECP29(value)          (MATRIX_SPSELR_NSECP29_Msk & ((value) << MATRIX_SPSELR_NSECP29_Pos))
#define MATRIX_SPSELR_NSECP30_Pos             _U_(30)                                              /**< (MATRIX_SPSELR) Non-secured Peripheral Position */
#define MATRIX_SPSELR_NSECP30_Msk             (_U_(0x1) << MATRIX_SPSELR_NSECP30_Pos)              /**< (MATRIX_SPSELR) Non-secured Peripheral Mask */
#define MATRIX_SPSELR_NSECP30(value)          (MATRIX_SPSELR_NSECP30_Msk & ((value) << MATRIX_SPSELR_NSECP30_Pos))
#define MATRIX_SPSELR_NSECP31_Pos             _U_(31)                                              /**< (MATRIX_SPSELR) Non-secured Peripheral Position */
#define MATRIX_SPSELR_NSECP31_Msk             (_U_(0x1) << MATRIX_SPSELR_NSECP31_Pos)              /**< (MATRIX_SPSELR) Non-secured Peripheral Mask */
#define MATRIX_SPSELR_NSECP31(value)          (MATRIX_SPSELR_NSECP31_Msk & ((value) << MATRIX_SPSELR_NSECP31_Pos))
#define MATRIX_SPSELR_Msk                     _U_(0xFFFFFFFF)                                      /**< (MATRIX_SPSELR) Register Mask  */

