Microchip-MPLAB-Harmony/csp/apps/flexcom/flexcom_spi_eeprom/firmware/src/packs/ATSAMA5D27_DFP/component/matrix.h
#define MATRIX_SPSELR_NSECP_Pos               _U_(0)                                               /**< (MATRIX_SPSELR Position) Non-secured Peripheral */
#define MATRIX_SPSELR_NSECP_Msk               (_U_(0xFFFFFFFF) << MATRIX_SPSELR_NSECP_Pos)         /**< (MATRIX_SPSELR Mask) NSECP */
#define MATRIX_SPSELR_NSECP(value)            (MATRIX_SPSELR_NSECP_Msk & ((value) << MATRIX_SPSELR_NSECP_Pos)) 

/** \brief MATRIX register offsets definitions */
#define MATRIX_PRAS_REG_OFST           (0x00)              /**< (MATRIX_PRAS) Priority Register A for Slave 0 Offset */
#define MATRIX_PRBS_REG_OFST           (0x04)              /**< (MATRIX_PRBS) Priority Register B for Slave 0 Offset */
#define MATRIX_MCFG_REG_OFST           (0x00)              /**< (MATRIX_MCFG) Master Configuration Register Offset */
#define MATRIX_SCFG_REG_OFST           (0x40)              /**< (MATRIX_SCFG) Slave Configuration Register Offset */
#define MATRIX_MEIER_REG_OFST          (0x150)             /**< (MATRIX_MEIER) Master Error Interrupt Enable Register Offset */
#define MATRIX_MEIDR_REG_OFST          (0x154)             /**< (MATRIX_MEIDR) Master Error Interrupt Disable Register Offset */
#define MATRIX_MEIMR_REG_OFST          (0x158)             /**< (MATRIX_MEIMR) Master Error Interrupt Mask Register Offset */
#define MATRIX_MESR_REG_OFST           (0x15C)             /**< (MATRIX_MESR) Master Error Status Register Offset */
#define MATRIX_MEAR_REG_OFST           (0x160)             /**< (MATRIX_MEAR) Master 0 Error Address Register Offset */
#define MATRIX_WPMR_REG_OFST           (0x1E4)             /**< (MATRIX_WPMR) Write Protection Mode Register Offset */
#define MATRIX_WPSR_REG_OFST           (0x1E8)             /**< (MATRIX_WPSR) Write Protection Status Register Offset */
#define MATRIX_SSR_REG_OFST            (0x200)             /**< (MATRIX_SSR) Security Slave 0 Register Offset */
#define MATRIX_SASSR_REG_OFST          (0x240)             /**< (MATRIX_SASSR) Security Areas Split Slave 0 Register Offset */
#define MATRIX_SRTSR_REG_OFST          (0x284)             /**< (MATRIX_SRTSR) Security Region Top Slave 1 Register Offset */
#define MATRIX_SPSELR_REG_OFST         (0x2C0)             /**< (MATRIX_SPSELR) Security Peripheral Select 1 Register Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief MATRIX_PR register API structure */
typedef struct
{
  __IO  uint32_t                       MATRIX_PRAS;        /**< Offset: 0x00 (R/W  32) Priority Register A for Slave 0 */
  __IO  uint32_t                       MATRIX_PRBS;        /**< Offset: 0x04 (R/W  32) Priority Register B for Slave 0 */
} matrix_pr_registers_t;

#define MATRIX_PR_NUMBER _U_(15)

/** \brief MATRIX register API structure */
typedef struct
{
  __IO  uint32_t                       MATRIX_MCFG[12];    /**< Offset: 0x00 (R/W  32) Master Configuration Register */
  __I   uint8_t                        Reserved1[0x10];
  __IO  uint32_t                       MATRIX_SCFG[15];    /**< Offset: 0x40 (R/W  32) Slave Configuration Register */
  __I   uint8_t                        Reserved2[0x04];
        matrix_pr_registers_t          MATRIX_PR[MATRIX_PR_NUMBER]; /**< Offset: 0x80  */
  __I   uint8_t                        Reserved3[0x58];
  __O   uint32_t                       MATRIX_MEIER;       /**< Offset: 0x150 ( /W  32) Master Error Interrupt Enable Register */
  __O   uint32_t                       MATRIX_MEIDR;       /**< Offset: 0x154 ( /W  32) Master Error Interrupt Disable Register */
  __I   uint32_t                       MATRIX_MEIMR;       /**< Offset: 0x158 (R/   32) Master Error Interrupt Mask Register */
  __I   uint32_t                       MATRIX_MESR;        /**< Offset: 0x15C (R/   32) Master Error Status Register */
  __I   uint32_t                       MATRIX_MEAR[12];    /**< Offset: 0x160 (R/   32) Master 0 Error Address Register */
  __I   uint8_t                        Reserved4[0x54];
  __IO  uint32_t                       MATRIX_WPMR;        /**< Offset: 0x1E4 (R/W  32) Write Protection Mode Register */
  __I   uint32_t                       MATRIX_WPSR;        /**< Offset: 0x1E8 (R/   32) Write Protection Status Register */
  __I   uint8_t                        Reserved5[0x14];
  __IO  uint32_t                       MATRIX_SSR[15];     /**< Offset: 0x200 (R/W  32) Security Slave 0 Register */
  __I   uint8_t                        Reserved6[0x04];
  __IO  uint32_t                       MATRIX_SASSR[15];   /**< Offset: 0x240 (R/W  32) Security Areas Split Slave 0 Register */
  __I   uint8_t                        Reserved7[0x08];
  __IO  uint32_t                       MATRIX_SRTSR[14];   /**< Offset: 0x284 (R/W  32) Security Region Top Slave 1 Register */
  __I   uint8_t                        Reserved8[0x04];
  __IO  uint32_t                       MATRIX_SPSELR[3];   /**< Offset: 0x2C0 (R/W  32) Security Peripheral Select 1 Register */
} matrix_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _SAMA5D2_MATRIX_COMPONENT_H_ */
